app/Http/Livewire/Auth/EmailVerify.php

    public function verifyOtp()
    {
        $otp = $this->digit1 . $this->digit2 . $this->digit3 . $this->digit4 . $this->digit5 . $this->digit6;


        $user = User::where('email', session('user'))->first();

        $checkotp = Otp::where('otp_code', $otp)
            ->where('user_id', $user->id)
            ->first();

        if ($checkotp) {

            // update the user status
            $user->update(['verify' => 1]);
---
select * from `users` where `email` = 'udosaint@gmail.com' limit 1
select * from `otps` where `otp_code` = '128275' and `user_id` = 1 limit 1
update `users` set `verify` = 1, `users`.`updated_at` = '2023-08-11 15:30:25' where `id` = 1