app/Http/Livewire/Auth/Login.php

select * from `users` where `email` = 'udosaint@gmail.com' limit 1
---
    public function LoginAccount(Request $request)
    {
        $validated = $this->validate([
            'email' => ['required', 'string', 'email'],
            'password' => ['required', 'min:8'],
        ]);

        $emailexist = User::where('email', $this->email)->first();