app/Traits/VerifyEmailAccount.php

insert into `otps` (`otp_code`, `user_id`, `updated_at`, `created_at`) values (997438, 1, '2023-08-11 10:38:11', '2023-08-11 10:38:11')
---
    public function sendAccountOtp($user)
    {
        $otp = rand(100000, 999999);

        //dd(['email' => $user->email, 'id' => $user->id, 'otp' => $otp]);

        Otp::create([
            'otp_code' => $otp,
            'user_id' => $user->id
        ]);

insert into `otps` (`otp_code`, `user_id`, `updated_at`, `created_at`) values (942675, 1, '2023-08-11 14:48:00', '2023-08-11 14:48:00')
---
    public function forgetPasswordOtp($user)
    {
        $otp = rand(100000, 999999);

        //dd(['email' => $user->email, 'id' => $user->id, 'otp' => $otp]);

        Otp::create([
            'otp_code' => $otp,
            'user_id' => $user->id
        ]);