app/Http/Livewire/Dashboard.php

select * from `folders` where `user_id` = 2
select * from `tasks` where (`user_id` = 2)
select `tasks`.`id`, `tasks`.`name`, `tasks`.`description`, `tasks`.`status`, `tasks`.`task_date` as `date`, `folders`.`name` as `folder`, `folders`.`icon` from `tasks` inner join `folders` on `tasks`.`folder_id` = `folders`.`id` where (`tasks`.`user_id` = 2) order by `tasks`.`created_at` desc limit 5
select * from `tasks` where (`user_id` = 2 and `status` = 1)
select * from `tasks` where (`user_id` = 2 and `status` = 0)
---
    public function display()
    {
        return [
            $user = auth()->id(),
            $this->folders = Folder::where('user_id', $user)->get(),
            $this->tasks = Task::where(['user_id' => $user])->get(),

            $this->top5 = Task::query()
                ->select('tasks.id', 'tasks.name', 'tasks.description', 'tasks.status', 'tasks.task_date as date', 'folders.name as folder', 'folders.icon')
                ->join('folders', 'tasks.folder_id', '=', 'folders.id')
                ->where(['tasks.user_id' => $user])
                ->limit(5)
                ->orderByDesc('tasks.created_at')
                ->get(),

            //$this->top5 = Task::with('user', 'folders')->get();

            $this->complete_tasks = Task::where(['user_id' => $user, 'status' => 1])->get(),
            $this->un_complete_tasks = Task::where(['user_id' => $user, 'status' => 0])->get(),

update `tasks` set `status` = 1, `tasks`.`updated_at` = '2023-08-11 15:34:37' where `id` = 7
---
    public function completeTask(Task $task)
    {
        $task->update(['status' => 1]);