app/Http/Livewire/Sidebar.php

    public function render()
    {

        //$this->user = User::where('id', auth()->user())->get();

        $this->user = auth()->user();
        $this->folders = Folder::where('user_id', auth()->id())
            ->get();

        $this->today = Task::where('task_date', now()->format('Y-m-d'))->count();
---
select * from `folders` where `user_id` = 2
select count(*) as aggregate from `tasks` where `task_date` = '2023-08-11'