app/Http/Livewire/Today.php

    public function display()
    {
        return [
            $user = auth()->id(),

            $this->today = Task::query()
                ->select('tasks.id', 'tasks.name', 'tasks.description', 'tasks.status', 'tasks.task_date as date', 'folders.name as folder', 'folders.icon')
                ->join('folders', 'tasks.folder_id', '=', 'folders.id')
                ->where(['tasks.user_id' => $user])
                ->where('task_date', now()->format('Y-m-d'))
                ->limit(5)
                ->orderByDesc('tasks.created_at')
                ->get(),
---
select `tasks`.`id`, `tasks`.`name`, `tasks`.`description`, `tasks`.`status`, `tasks`.`task_date` as `date`, `folders`.`name` as `folder`, `folders`.`icon` from `tasks` inner join `folders` on `tasks`.`folder_id` = `folders`.`id` where (`tasks`.`user_id` = 2) and `task_date` = '2023-08-11' order by `tasks`.`created_at` desc limit 5