app/Http/Livewire/UserTask.php

    public function mount(Task $task)
    {
        //$this->folders = Auth::user()->folders()->get();

        // the same with the code up
        $this->folders = Folder::where('user_id', auth()->id())
            ->get();
---
select * from `folders` where `user_id` = 2