app/Http/Controllers/AuthController.php

    function forgetPasswordStore(Request $request)
    {
        $form = $request->validate([
            'email' => ['required', 'string', 'email']
        ]);

        $email = $request->input('email');
        $emailExist = User::where('email', $email)->first();
---
select * from `users` where `email` = 'udosaint@gmail.com' limit 1